examples/Lousiana_uniform/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     forensicWindFoam;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         7200.0;

deltaT          0.1;

writeControl    adjustableRunTime;

writeInterval   120.0;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep  yes; /// <<<<<<<---- variable dt

maxCo           0.5;

maxDeltaT       10.0;


// ************************************************************************* //

libs ("libatmosphericModels.so");
